<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part IV. Merging files </h2>

<i>Example 1. Import the necessary libraries</i>

In [2]:
import pandas as pd
import numpy as np

<b>Exercise 1. Create the 3 dictionaries with the given attributes like the followings:</b><br>

|<b></b>|<b></b>|
|---|---|
|<b><center>data1</center></b><img src="data1.png" alt="student" style="width:3cm;height:4cm" />|<b><center>data2</center></b><img src="data2.png" alt="student" style="width:3cm;height:2.5cm" />|
|<b><center>data3</center></b><img src="data3.png" alt="student" style="width:2.25cm;height:3.75cm" />|<b><center>data4</center></b><img src="data4.png" alt="student" style="width:3cm;height:4cm" />|

<b>Exercise 2. Create the 3 DataFrames from the dictionaries.</b>

In [3]:
data_1_dict = {'student_id': range(1,11),
               'first_name': ['Mony', 'Nana', 'Ray', 'Alice', 'Ratanak', 'Nara', 'Ratana', 'Roth', 'Rith', 'Johnny'],
               'last_name': ['Sopheak', 'Tanaka', 'Allen', 'May', 'Sam', 'Kun', 'Vann', 'Sovann', 'Harrison', 'Cole']}

df_1 = pd.DataFrame(data_1_dict)

df_1

   student_id first_name last_name
0           1       Mony   Sopheak
1           2       Nana    Tanaka
2           3        Ray     Allen
3           4      Alice       May
4           5    Ratanak       Sam
5           6       Nara       Kun
6           7     Ratana      Vann
7           8       Roth    Sovann
8           9       Rith  Harrison
9          10     Johnny      Cole

In [4]:
data_2_dict = dict([('student_id', range(11, 16)),
                   ('first_name', ['John', 'Frank', 'James', 'Tom', 'Jennifer']),
                    ('last_name', ['Bond', 'Little', 'Collar', 'Brune', 'Stone'])])

df_2 = pd.DataFrame(data_2_dict)

df_2

   student_id first_name last_name
0          11       John      Bond
1          12      Frank    Little
2          13      James    Collar
3          14        Tom     Brune
4          15   Jennifer     Stone

In [45]:
data_3_dict = dict(subject_id=range(1,11),
                   subject_name=['Math', 'Geography', 'History', 'Literature', 'Research', 'IT', 'Moral', 'Art', 'Earth Science', 'Physics'])

df_3 = pd.DataFrame(data_3_dict)

df_3

   subject_id   subject_name
0           1           Math
1           2      Geography
2           3        History
3           4     Literature
4           5       Research
5           6             IT
6           7          Moral
7           8            Art
8           9  Earth Science
9          10        Physics

In [6]:
data_4_dict = {'student_id': range(1, 11),
               'subject_id': [1, 3, 7, 8, 5, 4, 2, 7, 1, 6],
               'test_score': [55, 75, 65, 93, 76, 80, 77, 81, 63, 89]}

df_4 = pd.DataFrame(data_4_dict)

df_4

   student_id  subject_id  test_score
0           1           1          55
1           2           3          75
2           3           7          65
3           4           8          93
4           5           5          76
5           6           4          80
6           7           2          77
7           8           7          81
8           9           1          63
9          10           6          89

<b>Exercise 3. Concat data1 and data2 Dataframes placing the data2 under data1.</b>

In [7]:
data2_under_data1 = pd.concat([df_1, df_2])

data2_under_data1

   student_id first_name last_name
0           1       Mony   Sopheak
1           2       Nana    Tanaka
2           3        Ray     Allen
3           4      Alice       May
4           5    Ratanak       Sam
5           6       Nara       Kun
6           7     Ratana      Vann
7           8       Roth    Sovann
8           9       Rith  Harrison
9          10     Johnny      Cole
0          11       John      Bond
1          12      Frank    Little
2          13      James    Collar
3          14        Tom     Brune
4          15   Jennifer     Stone

<b>Exercise 4. Concat data1 and data2 Dataframes placing the data2 on the right side of data1.</b>

In [ ]:
data2_right_of_data1 = pd.concat([df_1, df_2], axis=1)
# Normally axis=0 (concat by rows), axis=1 concat by columns (to the right)

data2_right_of_data1

   student_id first_name last_name  student_id first_name last_name
0           1       Mony   Sopheak        11.0       John      Bond
1           2       Nana    Tanaka        12.0      Frank    Little
2           3        Ray     Allen        13.0      James    Collar
3           4      Alice       May        14.0        Tom     Brune
4           5    Ratanak       Sam        15.0   Jennifer     Stone
5           6       Nara       Kun         NaN        NaN       NaN
6           7     Ratana      Vann         NaN        NaN       NaN
7           8       Roth    Sovann         NaN        NaN       NaN
8           9       Rith  Harrison         NaN        NaN       NaN
9          10     Johnny      Cole         NaN        NaN       NaN

<b>Exercise 5. Merge the result in <i>Exercise 3</i> with data4 and display the result.</b>

In [ ]:
# ex3_merge_df_4 = pd.merge(data2_under_data1, df_4)

ex3_merge_df_4 = pd.merge(data2_under_data1, df_4, on='student_id')
    # on= The column to merge on (student_id, which exists on both)
    # will only show id from 1-10, since df_4 only have 1-10
ex3_merge_df_4

   student_id first_name last_name  subject_id  test_score
0           1       Mony   Sopheak           1          55
1           2       Nana    Tanaka           3          75
2           3        Ray     Allen           7          65
3           4      Alice       May           8          93
4           5    Ratanak       Sam           5          76
5           6       Nara       Kun           4          80
6           7     Ratana      Vann           2          77
7           8       Roth    Sovann           7          81
8           9       Rith  Harrison           1          63
9          10     Johnny      Cole           6          89

<b>BONUS: Make a Complete Table, with the Student Information, as well as the subject and the test score</b>

In [52]:
subject_table = pd.merge(df_4, df_3, on='subject_id')

# ----- DisRegard this Comment :D (I wrongfully named subject_id as student_id for df_3)[It's changed now!] ------
# subject_table[['student_id_x', 'subject_id', 'subject_name', 'test_score']] # to show only some columns name
# merge on subject_id from df_4 with student_id from df_3 to get the subject names

# on: The column names to join on. 
# left_on and right_on: Columns in the left and right DataFrames, respectively, 
#                       to use as keys when their names are different.

student_table = pd.concat([df_1, df_2])

complete_table = pd.merge(student_table, subject_table, on='student_id')

complete_table

   student_id first_name last_name  subject_id  test_score subject_name
0           1       Mony   Sopheak           1          55         Math
1           2       Nana    Tanaka           3          75      History
2           3        Ray     Allen           7          65        Moral
3           4      Alice       May           8          93          Art
4           5    Ratanak       Sam           5          76     Research
5           6       Nara       Kun           4          80   Literature
6           7     Ratana      Vann           2          77    Geography
7           8       Roth    Sovann           7          81        Moral
8           9       Rith  Harrison           1          63         Math
9          10     Johnny      Cole           6          89           IT

<b>Exercise 6. How many points does Johnny Cole get in the test? Display the information, score and subjects of Johnny Cole.</b>

In [ ]:
j_cole_info = ex3_merge_df_4[(ex3_merge_df_4['first_name'] == 'Johnny') & (ex3_merge_df_4['last_name'] == 'Cole')]
# Use & (Bitwise) in pandas; it doesn't support 'and' like in normal Python
# Must () & () as well [() between conditions]

j_cole_info

   student_id first_name last_name  subject_id  test_score
9          10     Johnny      Cole           6          89

<b>Exercise 7. Which subject does Nara Kun take the test on? Display the information, score and subjects of Nara Kun.

In [54]:
n_kun = complete_table[(complete_table['first_name'] == 'Nara') & (complete_table['last_name'] == 'Kun')]

n_kun

   student_id first_name last_name  subject_id  test_score subject_name
5           6       Nara       Kun           4          80   Literature

<b>Exercise 8. Which subject does Mony Sopheak and James Collar take the test on? Display the information, score and subjects of the two students.

In [81]:
m_sopheak = complete_table[(complete_table['first_name'] == 'Mony') & (complete_table['last_name'] == 'Sopheak')]
j_collar = complete_table[(complete_table['first_name'] == 'James') & (complete_table['last_name'] == 'Collar')]

# OR, check for both
m_sopheak_and_j_collar = complete_table[((complete_table['first_name'] == 'Mony') & (complete_table['last_name'] == 'Sopheak')) | 
                                        ((complete_table['first_name'] == 'James') & (complete_table['last_name'] == 'Collar'))]

# Doesn't seem to have information for James Collar (student_id: 13)

# for student in m_sopheak_and_j_collar:
#     print(student)

    # --- 1. Using .iterrows() ---

    # .iterrows (iterate rows): creates an iterator that goes through the DataFrame row by row.: returns an iterator
for index, row in m_sopheak_and_j_collar.iterrows():
    print(f"{index}. {row['first_name']} {row['last_name']} scored {row['test_score']} on {row['subject_name']}.")
# If want index to start from 1: 
# for i, (index, row) in enumerate(m_sopheak_and_j_collar.iterrows(), start=1) xD

    # --- 2. Pythonic way, Using .apply() ---

# m_sopheak_and_j_collar.apply(lambda row: print(f"{row['first_name']} {row['last_name']} scored {row['test_score']} on {row['subject_name']}."), axis=1)

    # 3. --- Avoiding lamba, which you'll have to eventually use .iterrows anyway XD ---
    
# def print_info(df):
#     for index, row in df.iterrows(): # I guess iterrows() is the only way to access rows Pythonically in Pandas (idk if this even makes sense xD)
#         print(f"{row['first_name']} {row['last_name']} scored {row['test_score']} on {row['subject_name']}.")

# print_info(m_sopheak_and_j_collar)

0. Mony Sopheak scored 55 on Math.